src/cf/Documents/уатДТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатДТП</Name>
			<BasedOn>
				<xr:Item>Document.уатПутевойЛист</xr:Item>
				<xr:Item>Document.уатАктПриемаПередачиТС</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДТП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виновность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОВодителе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОТранспортномСредстве</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДТП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСправкиГИБДД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатАктПриемаПередачиТС</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатериальныйУщербОтПоврежденияГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатериальныйУщербОтПоврежденияДорогИСооружений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатериальныйУщербОтПоврежденияТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоДТП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСправкиГИБДД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбстоятельстваДТП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повреждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогиблоЧеловек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятыеМеры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаДТП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПричиныДТП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаненоЧеловек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СведенияОПострадавших</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпанияДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпанияНомерДела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпанияПримечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпанияСуммаВыплаченная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРемонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияОрганизацииИОсуществленияПеревозок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспертизаДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспертизаКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспертизаНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспертизаПримечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспертизаСуммаУщерба</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ремонты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РемонтныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КузовныеЭлементы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КузовнойЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСостоянияЭлементовТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПовреждений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактерПовреждений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатХарактерыПовреждений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/уатСчетчикиТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатСчетчикиТС</Name>
			<Comment>Показания одометров и счетчиков транспортных средств</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыСчетчиковТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Comment>ТС или оборудование</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатПринадлежностьДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатПринадлежностьДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументыТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыВодителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыКонтрагента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатТипыСчетчиковТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыСчетчиковТС</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Спидометр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетчикМЧ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатДТП/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатДокументФормаЭлементаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьСписокВыбораЭкипажа();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТСПриИзменении(Элемент)
	
	// установим водителя ТС
	Если ЗначениеЗаполнено(Объект.ТС) Тогда
		уатОбщегоНазначения.ЗаполнитьЭкипажТС(Объект.ТС, Объект.Организация, Объект.Дата, Объект.Водитель);
	КонецЕсли;
	
	// установим текущее местонахождение ТС
	МестонахождениеТС = уатОбщегоНазначения.МестонахождениеТС(Объект.ТС, Объект.Дата);
	Если НЕ ЗначениеЗаполнено(Объект.Колонна) Тогда
		Объект.Колонна = МестонахождениеТС.Колонна;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = МестонахождениеТС.Организация;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Объект.Подразделение = МестонахождениеТС.Подразделение;
	КонецЕсли;
	
	ОбновитьСписокВыбораЭкипажа();
	
КонецПроцедуры

&НаКлиенте
Процедура ТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	уатИнтерфейсВводаТС.РеквизитТСНачалоВыбора(Элемент, Объект.ТС, ДанныеВыбора,
		СтандартнаяОбработка, СтруктураОтборТС());
КонецПроцедуры

&НаКлиенте
Процедура ТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	уатИнтерфейсВводаТС.РеквизитТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание,
		СтандартнаяОбработка, СтруктураОтборТС());
КонецПроцедуры

&НаКлиенте
Процедура ТСОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	уатИнтерфейсВводаТС.РеквизитТСОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
		СтандартнаяОбработка, СтруктураОтборТС());
КонецПроцедуры

&НаКлиенте
Процедура ВодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	уатЗащищенныеФункцииКлиент.ДиалогВыбораСотрудника(Элемент, Объект.Водитель, Новый Структура("Организация", Объект.Организация), СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВодительОткрытие(Элемент, СтандартнаяОбработка)
	уатЗащищенныеФункцииКлиент.ОткрытьФормуСотрудника(Объект.Водитель, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВодительАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	Если Ожидание = 0 Тогда //выбор из списка
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("Организация, ДатаСреза", Объект.Организация, Объект.Дата);
	уатИнтерфейсВводаСотрудников.СотрудникАвтоПодборТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура ВодительОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтруктураПараметров = Новый Структура("Организация, ДатаСреза", Объект.Организация, Объект.Дата);
	уатИнтерфейсВводаСотрудников.СотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура ПоврежденияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Повреждения");
КонецПроцедуры

&НаКлиенте
Процедура МестоДТПНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.МестоДТП");
КонецПроцедуры

&НаКлиенте
Процедура ВидДТПНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.ВидДТП");
КонецПроцедуры

&НаКлиенте
Процедура ОбстоятельстваДТПНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.ОбстоятельстваДТП");
КонецПроцедуры

&НаКлиенте
Процедура УсловияОрганизацииИОсуществленияПеревозокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.УсловияОрганизацииИОсуществленияПеревозок");
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПострадавшихНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.СведенияОПострадавших");
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыРемонты

&НаКлиенте
Процедура РемонтыПриИзменении(Элемент)
	Объект.СуммаРемонта = 0;
	Для Каждого ТекСтрока Из Объект.Ремонты Цикл
		Объект.СуммаРемонта = Объект.СуммаРемонта + СуммаРемонтаПоДокументу(ТекСтрока.РемонтныйЛист);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыКузовныеЭлементы

&НаКлиенте
Процедура КузовныеЭлементыКузовнойЭлементПриИзменении(Элемент)
	
	ТекСтрока = Элементы.КузовныеЭлементы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(Объект.ДатаДТП) Тогда
		ДатаСрезаПред = Объект.ДатаДТП-1;
	Иначе
		ДатаСрезаПред = Объект.Дата-1;
	КонецЕсли;
	
	ТекСостояниеКузовногоЭлемента = ТекСостояниеКузовногоЭлемента(ТекСтрока.КузовнойЭлемент,
		Объект.ТС, ДатаСрезаПред);
	ТекСтрока.Состояние           = ТекСостояниеКузовногоЭлемента.Состояние;	
	ТекСтрока.НаличиеПовреждений  = ТекСостояниеКузовногоЭлемента.НаличиеПовреждений;
	ТекСтрока.ХарактерПовреждений = ТекСостояниеКузовногоЭлемента.ХарактерПовреждений;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ЗаполнитьДанныeВодителя(Команда)
	
	ДанныеВодителя = ПолучитьДанныеВодителя();
	
	Если ЗначениеЗаполнено(ДанныеВодителя.ФИОВодителя) Тогда
		СтрокаДанныеВодителя = НСтр("en='Driver: ';ru='Водитель: '") + ДанныеВодителя.ФИОВодителя + Символы.ПС;
	Иначе
		СтрокаДанныеВодителя = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеВодителя.КлассВодителя) Тогда
		СтрокаДанныеВодителя = СтрокаДанныеВодителя + НСтр("ru = 'Класс водителя: '; en = 'Driver class:'") + ДанныеВодителя.КлассВодителя + Символы.ПС; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеВодителя.СтажВодителя) Тогда
		СтрокаДанныеВодителя = СтрокаДанныеВодителя + НСтр("ru = 'Стаж с '; en = 'Experience with'") + Лев(ДанныеВодителя.СтажВодителя, 10);
	КонецЕсли;
	
	Объект.ДанныеОВодителе = СтрокаДанныеВодителя;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеТС(Команда)
	
	ДанныеТС = ПолучитьДанныеТС();
	
	Если ЗначениеЗаполнено(ДанныеТС.СрокЭксплуатации) Тогда
		СтрокаДанныеТС = НСтр("ru = 'Срок эксплуатации ТС с '; en = 'The service life of the vehicle is'") + Лев(ДанныеТС.СрокЭксплуатации, 10) + Символы.ПС;
	Иначе
		СтрокаДанныеТС = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеТС.Пробег) Тогда
		СтрокаДанныеТС = СтрокаДанныеТС + НСтр("ru = 'Пробег ТС: '; en = 'Vehicle mileage:'") + ДанныеТС.Пробег + " " + НСтр("en='km.';ru='км.'") + Символы.ПС; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеТС.ДатаПоследнегоТО) Тогда
		СтрокаДанныеТС = СтрокаДанныеТС + НСтр("ru = 'Дата последнего ТО: '; en = 'Date of last maintenance:'") + Лев(ДанныеТС.ДатаПоследнегоТО, 10);
	КонецЕсли;
	
	Объект.ДанныеОТранспортномСредстве = СтрокаДанныеТС;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымГИБДД(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ТС) Тогда
		ТекстНСТР = НСтр("ru = 'Не заполнено ТС.'; en = 'TS not filled in.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		Возврат;
	КонецЕсли;
	
	VIN = ЗначениеРеквизитаОбъекта(Объект.ТС, "VIN");
	Если НЕ ЗначениеЗаполнено(VIN) Тогда
		ТекстНСТР = НСтр("ru = 'У ТС не заполнен VIN.'; en = ""The vehicle's VIN is not filled in.""");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		Возврат;
	КонецЕсли;

	ОписаниеОповещения = Новый ОписаниеОповещения("ПодтверждениеКапчи", ЭтотОбъект,
		VIN);
	ПараметрыОткрытия  = Новый Структура();
	ОткрытьФорму("Документ.уатДТП.Форма.ФормаКапчи", ПараметрыОткрытия,ЭтотОбъект,,,,ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУстановленныеКузовныеЭлементы(Команда)
	
	Если Объект.КузовныеЭлементы.Количество() > 0 Тогда
		Оповещ = Новый ОписаниеОповещения("ЗаполнитьКузовныеЭлементыВопрос", ЭтотОбъект,
			Новый Структура("ТолькоПоврежденные", Ложь));
		ТекстНСТР = НСтр("en='Table will be cleared before filling! Continue?';ru='Перед заполнением таблица будет очищена! Продолжить?'");
		ПоказатьВопрос(Оповещ, ТекстНСТР, РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКузовныеЭлементыЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКузовныеЭлементыВопрос(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьКузовныеЭлементыЗавершение(ДопПараметры.ТолькоПоврежденные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКузовныеЭлементыЗавершение(ТолькоПоврежденные = Ложь)

	МоментСреза = Новый Граница(Объект.Дата, ВидГраницы.Исключая);
	
	Объект.КузовныеЭлементы.Очистить();
	Если ЗначениеЗаполнено(Объект.ТС) Тогда
		тблКузовныеЭлементы = уатОбщегоНазначения_проф.уатКузовныеЭлементыТС(Объект.ТС, МоментСреза, ТолькоПоврежденные);
		Для Каждого ТекСтрока Из тблКузовныеЭлементы Цикл
			НоваяСтрока = Объект.КузовныеЭлементы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Модифицированность = Истина;
		
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервереБезКонтекста
Функция СуммаРемонтаПоДокументу(РемЛист)
	Возврат РемЛист.Работы.Итог("Сумма") + РемЛист.Материалы.Итог("Сумма");
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокВыбораЭкипажа()
	Элементы.Водитель.СписокВыбора.Очистить();
	
	ЭкипажТССписок = уатЗащищенныеФункцииСервер.ЭкипажТССписок(Объект.ТС, Объект.Дата);
	ЭкипажТССписок_Количество = ЭкипажТССписок.Количество();
	
	
	Если ЭкипажТССписок_Количество = 0 Тогда	
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСотр Из ЭкипажТССписок Цикл
		Элементы.Водитель.СписокВыбора.Добавить(ТекСотр.Значение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция СтруктураОтборТС()
	СтруктураОтбор = Новый Структура("Организация", Объект.Организация);
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		СтруктураОтбор.Вставить("Подразделение", Объект.Подразделение);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Колонна) Тогда
		СтруктураОтбор.Вставить("Колонна", Объект.Колонна);
	КонецЕсли;
	
	Возврат СтруктураОтбор;
КонецФункции

&НаСервере
Функция ПолучитьДанныеВодителя()
	
	СтруктураВозврата = Новый Структура();
	
	// Фио водителя
	СтруктураВозврата.Вставить("ФИОВодителя", уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Водитель, "Наименование"));
	
	// Класс водителя
	СтруктураВозврата.Вставить("КлассВодителя", Объект.Водитель.Класс);
	
	// Стаж водителя
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегистрСведенийуатДокументыВодителей.ВладелецДокументов КАК ВладелецДокументов,
	|	РегистрСведенийуатДокументыВодителей.ДатаВыдачи КАК ДатаВыдачи
	|ИЗ
	|	Справочник.уатРегистрационныеДокументы КАК РегистрСведенийуатДокументыВодителей
	|ГДЕ
	|	РегистрСведенийуатДокументыВодителей.ПринадлежностьДокументов = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьДокументов.ДокументыВодителя)
	|	И НЕ РегистрСведенийуатДокументыВодителей.ПометкаУдаления
	|	И РегистрСведенийуатДокументыВодителей.ВладелецДокументов = &ВладелецДокументов
	|	И РегистрСведенийуатДокументыВодителей.ВидДокумента = ЗНАЧЕНИЕ(Справочник.уатВидыДокументов.УдостоверениеВодителя)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыдачи");
	Запрос.УстановитьПараметр("ВладелецДокументов", Объект.Водитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыгрузкаЗапроса = РезультатЗапроса.Выгрузить();
		Стаж = Строка(ВыгрузкаЗапроса[0].ДатаВыдачи);
	Иначе
		Стаж = "";
	КонецЕсли;
	СтруктураВозврата.Вставить("СтажВодителя", Стаж);
	
	Возврат СтруктураВозврата;
	
Конецфункции

&НаСервере
Функция ПолучитьДанныеТС()
	
	СтруктураВозврата = Новый Структура();
	
	// Срок эксплуатации тс
	СтруктураВозврата.Вставить("СрокЭксплуатации", уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ТС, "ДатаВводаВЭксплуатацию"));
	
	// Пробег ТС по одометру
	СтруктураОтбора = Новый Структура("ТипСчетчика, ТС", Перечисления.уатТипыСчетчиковТС.Спидометр, Объект.ТС);
	СрезПоследних = РегистрыСведений.уатСчетчикиТС.СрезПоследних(Объект.ДатаДТП, СтруктураОтбора);
	Если СрезПоследних.Количество() Тогда
		Пробег = Строка(СрезПоследних[0].Значение);
	Иначе
		Пробег = "";
	КонецЕсли;
	СтруктураВозврата.Вставить("Пробег", Пробег);
	
	// Дата последнего ТО
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	уатРемонтныйЛист.ДатаОкончания КАК Дата
	|ИЗ
	|	Документ.уатРемонтныйЛист КАК уатРемонтныйЛист
	|ГДЕ
	|	уатРемонтныйЛист.Проведен
	|	И НЕ уатРемонтныйЛист.ПометкаУдаления
	|	И (уатРемонтныйЛист.ВидОбслуживания.ВидОбслуживанияТС = ЗНАЧЕНИЕ(Перечисление.уатВидыОбслуживания.Техобслуживание)
	|			ИЛИ уатРемонтныйЛист.ВидОбслуживания2.ВидОбслуживанияТС = ЗНАЧЕНИЕ(Перечисление.уатВидыОбслуживания.Техобслуживание)
	|			ИЛИ уатРемонтныйЛист.ВидОбслуживания3.ВидОбслуживанияТС = ЗНАЧЕНИЕ(Перечисление.уатВидыОбслуживания.Техобслуживание))
	|	И уатРемонтныйЛист.ТС = &ТС
	|	И уатРемонтныйЛист.Выполнен
	|	И уатРемонтныйЛист.ДатаОкончания <= &ДатаДТП
	|
	|УПОРЯДОЧИТЬ ПО
	|	уатРемонтныйЛист.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаДТП", Объект.ДатаДТП);
	Запрос.УстановитьПараметр("ТС", Объект.ТС);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыгрузкаЗапроса = РезультатЗапроса.Выгрузить();
		ДатаТО = Строка(ВыгрузкаЗапроса[0].Дата);
	Иначе
		ДатаТО = "";
	КонецЕсли;
	СтруктураВозврата.Вставить("ДатаПоследнегоТО", ДатаТО);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоДаннымГИБДДНачалоВыбораЗавершение(ТекДТП, ДопПараметры) Экспорт
	
	Если ТекДТП <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, ТекДТП);
		
		ЗаполненыРеквизиты = "";
		Если ТекДТП.Свойство("ДатаДТП") Тогда
			ЗаполненыРеквизиты = ?(ЗаполненыРеквизиты = "", "Дата ДТП",
			ЗаполненыРеквизиты + ", " + "Дата ДТП");
		КонецЕсли;
		Если ТекДТП.Свойство("НомерСправкиГИБДД") Тогда
			ЗаполненыРеквизиты = ?(ЗаполненыРеквизиты = "", "Номер справки ГИБДД",
			ЗаполненыРеквизиты + ", " + "Номер справки ГИБДД");
		КонецЕсли;
		Если ТекДТП.Свойство("ДатаСправкиГИБДД") Тогда
			ЗаполненыРеквизиты = ?(ЗаполненыРеквизиты = "", "Дата справки ГИБДД",
			ЗаполненыРеквизиты + ", " + "Дата справки ГИБДД");
		КонецЕсли;
		Если ТекДТП.Свойство("МестоДТП") Тогда
			ЗаполненыРеквизиты = ?(ЗаполненыРеквизиты = "", "Место ДТП",
			ЗаполненыРеквизиты + ", " + "Место ДТП");
		КонецЕсли;
		Если ТекДТП.Свойство("ВидДТП") Тогда
			ЗаполненыРеквизиты = ?(ЗаполненыРеквизиты = "", "Вид ДТП",
			ЗаполненыРеквизиты + ", " + "Вид ДТП");
		КонецЕсли;
		Если ТекДТП.Свойство("Повреждения") Тогда
			ЗаполненыРеквизиты = ?(ЗаполненыРеквизиты = "", "Повреждения",
			ЗаполненыРеквизиты + ", " + "Повреждения");
		КонецЕсли;
		ТекстНСТР = СтрШаблон(НСтр("ru = 'Заполнены реквизиты: %1'; en = 'Details filled in: %1'"), ЗаполненыРеквизиты);
		ПоказатьПредупреждение(,ТекстНСТР);

	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьПоДаннымГИБДДНаСервере(VIN, Капча, ТекстОшибки)
	
	ЗапросВыполнен = Ложь;
	ДанныеДТП = уатИнтеграции_проф.ГИБДД_ПолучитьИсториюДТП(VIN, Капча, ЗапросВыполнен, ТекстОшибки);
	Возврат ДанныеДТП;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

&НаКлиенте
Процедура ПодтверждениеКапчи(Результат, VIN) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Капча       = Новый Структура();
	Капча.Вставить("captchaToken", Результат.captchaToken);
	Капча.Вставить("captchaWord",  Результат.captchaWord);
	
	ТекстОшибки = "";
	ДанныеДТП   = ЗаполнитьПоДаннымГИБДДНаСервере(VIN, Капча, ТекстОшибки);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
	 	ТекстНСТР = НСтр("ru = 'Онлайн сервисы ГИББД недоступны в данный момент."
"Повторите попытку позже или выполните запрос по ссылке в браузере и вручную скопируйте результат запроса в программу'; en = ""The State Traffic Safety Inspectorate's online services are currently unavailable."
"Please try again later or search for the link in your browser and manually copy the search results into the program.""");
		
		ТекстПредупреждения = Новый ФорматированнаяСтрока(
		НСтр("ru = 'Онлайн сервисы ГИББД недоступны в данный момент.'; en = ""The State Traffic Safety Inspectorate's online services are currently unavailable."""),
		Символы.ПС,
		НСтр("ru = 'Повторите попытку позже или выполните запрос по '; en = 'Please try again later or make a request via'"),
		Новый ФорматированнаяСтрока(НСтр("ru = 'ссылке в браузере'; en = 'link in the browser'"),,,, "https://гибдд.рф/check/auto#" + VIN),
		НСтр("ru = ' и вручную скопируйте результат запроса в программу.'; en = 'and manually copy the query result into the program.'")
		);
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;

	Если ДанныеДТП.Количество() = 0 Тогда
		ТекстНСТР = НСтр("ru = 'ДТП не найдены'; en = 'No accidents found'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		Возврат;
	КонецЕсли;

	ДТПНайдено = Ложь;
	СписокДТП  = Новый СписокЗначений;

	Для Каждого ТекДТП Из ДанныеДТП Цикл
		Если Объект.НомерСправкиГИБДД = ТекДТП.НомерСправкиГИБДД Тогда
			ЗаполнитьЗначенияСвойств(Объект, ТекДТП);
			
			ЗаполненыРеквизиты = "";
			Если ТекДТП.Свойство("ДатаДТП") Тогда
				ЗаполненыРеквизиты = ?(ЗаполненыРеквизиты = "", "Дата ДТП",
					ЗаполненыРеквизиты + ", " + "Дата ДТП");
			КонецЕсли;
			Если ТекДТП.Свойство("НомерСправкиГИБДД") Тогда
				ЗаполненыРеквизиты = ?(ЗаполненыРеквизиты = "", "Номер справки ГИБДД",
					ЗаполненыРеквизиты + ", " + "Номер справки ГИБДД");
			КонецЕсли;
			Если ТекДТП.Свойство("ДатаСправкиГИБДД") Тогда
				ЗаполненыРеквизиты = ?(ЗаполненыРеквизиты = "", "Дата справки ГИБДД",
					ЗаполненыРеквизиты + ", " + "Дата справки ГИБДД");
			КонецЕсли;
			Если ТекДТП.Свойство("МестоДТП") Тогда
				ЗаполненыРеквизиты = ?(ЗаполненыРеквизиты = "", "Место ДТП",
					ЗаполненыРеквизиты + ", " + "Место ДТП");
			КонецЕсли;
			Если ТекДТП.Свойство("ВидДТП") Тогда
				ЗаполненыРеквизиты = ?(ЗаполненыРеквизиты = "", "Вид ДТП",
					ЗаполненыРеквизиты + ", " + "Вид ДТП");
			КонецЕсли;
			Если ТекДТП.Свойство("Повреждения") Тогда
				ЗаполненыРеквизиты = ?(ЗаполненыРеквизиты = "", "Повреждения",
					ЗаполненыРеквизиты + ", " + "Повреждения");
			КонецЕсли;
			ТекстНСТР = СтрШаблон(НСтр("ru = 'Заполнены реквизиты: %1'; en = 'Details filled in: %1'"), ЗаполненыРеквизиты);
			ПоказатьПредупреждение(,ТекстНСТР);
			ДТПНайдено = Истина;
			Прервать;
		КонецЕсли;
		
		ПредставлениеДТП = ТекДТП.ВидДТП + " от " + ТекДТП.ДатаДТП;
		СписокДТП.Добавить(ТекДТП, ПредставлениеДТП);
	КонецЦикла;
	
	Если НЕ ДТПНайдено
		И ДанныеДТП.Количество() <> 0 Тогда
		ОповещениеВыбора = Новый ОписаниеОповещения("ЗаполнитьПоДаннымГИБДДНачалоВыбораЗавершение", ЭтотОбъект);
		ОткрытьФорму("Документ.уатДТП.Форма.ФормаВыбораСправочников",
		Новый Структура("ИмяОбъектаВыбора, СписокОбъектов, Заголовок", "Список", СписокДТП, НСтр("ru = 'Выберите ДТП'; en = 'Select an accident'")),
		ЭтотОбъект,,,, ОповещениеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекСостояниеКузовногоЭлемента(КузовнойЭлемент, ТС, ДатаСреза)

	Рез = уатОбщегоНазначения_проф.уатСостояниеКузовногоЭлемента(КузовнойЭлемент, ТС,
		Новый Граница(ДатаСреза, ВидГраницы.Исключая));
	Возврат Рез;
	
КонецФункции

#КонецОбласти
